# package manager
brew "npm"
brew "pnpm"
brew "yarn"

# git
brew "git"
brew "ghq"
brew "gh"
brew "git-delta"
brew "lazygit"

# coding
brew "neovim"
brew "mise"
brew "lua-language-server"
brew "terraform-ls"

# terminal
brew "starship"
brew "xplr"

# utilities
brew "yazi"
brew "zoxide"
brew "gawk"
brew "colordiff"
brew "jq"
brew "yq"
brew "ynqa/tap/jnv"
brew "fzf"
brew "fzy"
brew "fd"
brew "rg"
brew "bat"
brew "ast-grep"
brew "cheat"
brew "asciinema"
brew "silicon"
brew "urlview"
brew "caddy"
brew "expect"
brew "git-who"
brew "idoavrah/homebrew/tftui"

# container
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "helm"
brew "helmfile"
brew "stern"
brew "k9s"
brew "kind"
brew "lazydocker"
brew "buildkit"
brew "hadolint"
brew "dive"
brew "skaffold"

# development tools
brew "gitleaks"
brew "terraform"
brew "gotestsum"
brew "golangci-lint"
brew "go-task"
brew "cue"
brew "conftest"
brew "golang-migrate"
brew "bufbuild/buf/buf"
brew "protobuf"
brew "uv"
brew "lazysql"
brew "ymtdzzz/tap/otel-tui"

# troubleshooting
brew "wireshark"
brew "alp"
brew "httpstat"
brew "viddy"
brew "btop"
brew "k6"
