cask "xcode"
cask "notion"
cask "slack"
cask "zoom"
cask "kindle"
cask "enpass"
cask "1password"
cask "google-chrome"
cask "font-hack-nerd-font"
cask "visual-studio-code"
cask "android-studio"
cask "android-platform-tools"
cask "lens"
cask "coteditor"
cask "iterm2"
cask "shiftit"
cask "alfred"
cask "contexts"
cask "choosy"
cask "graphiql"
