tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# shell
brew "zsh"

# git
brew "ghq"
brew "gh"
brew "hub"
brew "git"
brew "tig"
brew "git-open"

# tools
brew "fzf"
brew "gawk"
brew "unzip"
brew "colordiff"
brew "gnu-sed"
brew "act"
brew "jq"
brew "yq"
brew "fzf"
brew "fzy"
brew "fd"
brew "rg"
brew "bat"
brew "git-delta"
brew "starship"
brew "tmux"
brew "tree"
brew "viddy"
brew "watch"
brew "cheat"
brew "htop"
brew "asciinema"
brew "asdf"
brew "actionlint"
brew "jsonnet"
brew "silicon"
brew "openssl"
brew "zsh-autosuggestions"
brew "neovim", args: ["HEAD"]
cask "alacritty"

# lua
brew "lua-language-server"

# nodejs
brew "gnupg"
brew "yarn"

# cpp
brew "ccls"

# rust
brew "rust-analyzer"

# python
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "reattach-to-user-namespace"

# yaml
brew "yaml-language-server"

# network
brew "grpcurl"
brew "dnsmasq"
brew "unbound"
brew "vegeta"

# kubernetes
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "helm"
brew "helmfile"
brew "stern"
brew "k9s"
brew "fluxcd/tap/flux"
brew "skaffold"
brew "kind"

# docker
brew "docker"
brew "buildkit"
brew "hadolint"
brew "trivy"

# terraform
brew "tfenv"
brew "terraform"
brew "tflint"
brew "terraform-ls"

