if OS.mac?
  brew "gpg"
  brew "enpass"
  brew "raycast"
  brew "alacritty"
  brew "docker"
  brew "colima"
  cask brew "edge"
  cask brew "slack"
  cask brew "alt-tab"
  cask brew "karabiner-elements"
  cask brew "mos"
  cask brew "rectangle"
  cask brew "font-fira-code-nerd-font"
  cask brew "google-japanese-ime"
  brew 'coreutils'
  brew 'grep'
  brew 'gnu-sed'
  brew "docker-buildx"
end

# package manager
brew "npm"
brew "pnpm"
brew "yarn"
brew "pipx"

# git
brew "git"
brew "ghq"
brew "gh"
brew "git-delta"
brew "lazygit"

# coding
brew "neovim"
brew "mise"
brew "lua-language-server"
brew "terraform-ls"
brew "devcontainer"

# terminal
brew "starship"
brew "tmux"
brew "tmuxinator"
brew "xplr"

# utilities
brew "yazi"
brew "zoxide"
brew "gawk"
brew "colordiff"
brew "jq"
brew "yq"
brew "jnv"
brew "fzf"
brew "fzy"
brew "fd"
brew "rg"
brew "bat"
brew "ast-grep"
brew "cheat"
brew "asciinema"
brew "silicon"
brew "urlview"
brew "caddy"
brew "expect"
brew "git-who"
brew "marp-cli"

# container
brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "helm"
brew "helmfile"
brew "stern"
brew "k9s"
brew "kind"
brew "lazydocker"
brew "buildkit"
brew "hadolint"
brew "dive"
brew "skaffold"

# development tools
brew "gitleaks"
brew "terraform"
brew "gotestsum"
brew "golangci-lint"
brew "go-task"
brew "cue"
brew "conftest"
brew "golang-migrate"
brew "protobuf"
brew "uv"
brew "lazysql"

# troubleshooting
brew "wireshark"
brew "alp"
brew "httpstat"
brew "viddy"
brew "btop"
brew "k6"
